[
  {
    "type": "slide",
    "title": "Now that you are done listening, begin reading to understand the Smart Tips in detail.",
    "text": [
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Don’t worry too much about Making Mistakes"
        },
        {
          "type": "paragraph",
          "text": "Many learners worry that they are going to make a mistake or that the people listening will not understand them. English is not your native language. While speaking English, you will probably feel that you’re making a hundred mistakes – but, in fact, you’re only making the same five or six mistakes’ hundreds of times. Get over your shyness and hesitation. Use the language as often as you can, the more you speak the faster you will learn and easier it becomes."
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Don’t Speak Very Fast"
        },
        {
          "type": "paragraph",
          "text": "Being fluent does not mean speaking quickly. It is better to speak slowly and clearly than quickly and incoherently. Speak too quickly with the wrong intonation and rate of speech and others will have a hard time understanding you. Don’t worry about them getting impatient with your slow speech – it is more important that everything you say be understood by the listener."
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Be a Confident Speaker"
        },
        {
          "type": "paragraph",
          "text": "Speaking is easier when you have something to say, and you are enjoying the conversion. Planning and rehearsal can make your speaking more confident. Try to keep a relaxed attitude. If you are too worried about correctness, your speech may be filled with unnecessary pauses..People who think and say “Every day in every way, my English is getting better and better” learn faster .Practise saying this  every day, and you will see greater improvement in your English and in your confidence."
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Don’t follow written English Style / don’t learn by heart"
        },
        {
          "type": "paragraph",
          "text": "Don’t try to follow a formal written English style while speaking English. Don’t make deliberate attempts to speak full and complete sentences as in written English. Also don’t try to connect your sentences all the time through logical connectors like \"Above all\", ‘in addition to’ etc."
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Speak Spontaneously"
        },
        {
          "type": "paragraph",
          "text": "Don’t try to speak by translating  sentences from other languages/ mother tongue. You will learn why in the coming lessons. Always speak spontaneously. Talk to yourself, rehearsing conversation and explanations you might need to do. Play back in your mind the good English  that you hear, mimic intonation, stress, and rate of speech. This will help you to think in English, improve your fluency and reduce your anxiety about speaking in English."
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Don’t worry about starting trouble"
        },
        {
          "type": "paragraph",
          "text": "Even native speakers of English find it difficult to get started.So, don’t let the starting trouble disturb you. Using discourse markers is a good idea in handling staring trouble. Okay, all right, right then, well, you know, etc., are all examples of discourse markers used in conversation. They are used to give the speaker a second to think about what they want to say."
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Hear English Everywhere "
        },
        {
          "type": "paragraph",
          "text": "If you can communicate well in one language, then you can certainly do so in other languages. “How did you learn your language?”  In fact, you never really “learnt” it at all – you just started speaking it. One day, when you were about two or three years old, you started speaking your language. A few words at first, not full sentences. It was like magic! However, it wasn’t magic. It was the result of hearing. You heard people speaking your language all day. Maybe you listened to people, but it was mostly hearing unconsciously in the beginning. All that hearing was necessary for you to start speaking. For two to three years, words went into your head. Then words come out of your head. That is why hearing (and listening to) English as much as possible is so important to you now. The more English you put in, the more you’ll get out!"
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Watch Television, films, and relevant social media"
        },
        {
          "type": "paragraph",
          "text": "Television and films are excellent sources for hearing and listening to English. The pictures help you understand what is being said. Look at the lip movements of the speakers. Repeat what they are saying, imitating the intonation and rhythm of their speech. If you need to, read the subtitles, at least you’ll be hearing English even if you don’t understand. Your social media can be a good way to learn communicative English. If you turn your Instagram, Facebook, Twitter, and other smartphone settings to ‘English’ then you can continue to learn the language while you’re communicating with friends."
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Learn English idioms and phrases"
        },
        {
          "type": "paragraph",
          "text": "There are many aspects of the English language that you will not always find in school or college books. Idioms and phrases are extremely common in everyday English conversations. If you manage to learn these then you’ll find it much easier to talk and understand others. "
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Converse with Friends and family"
        },
        {
          "type": "paragraph",
          "text": "Try to practise English with your friends and family members. Of course, this will help you in speaking as well as listening. If you want to speak English better in the future, speak it as much as possible with people who will not judge you."
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Develop your vocabulary"
        },
        {
          "type": "paragraph",
          "text": "Take an active approach to learning new words. If you find 5 words a day, 6 days a week, you will learn about 130 new words a month. Keep a small notebook handy or use your smart phones. As you read, study, watch TV or talk with people, note down words and expressions that you think would be helpful for you. You will sound more fluent and comprehensible if you use words in combinations that fluent speakers are used to hearing. Look it up in your dictionary or vocabulary Apps and look up the correct pronunciation of words that are hard for you to say."
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Develop your vocabulary"
        },
        {
          "type": "paragraph",
          "text": "Take an active approach to learning new words. If you find 5 words a day, 6 days a week, you will learn about 130 new words a month. Keep a small notebook handy or use your smart phones. As you read, study, watch TV or talk with people, note down words and expressions that you think would be helpful for you. You will sound more fluent and comprehensible if you use words in combinations that fluent speakers are used to hearing. Look it up in your dictionary or vocabulary Apps and look up the correct pronunciation of words that are hard for you to say."
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Communicate with confidence"
        },
        {
          "type": "paragraph",
          "text": "Breath! As with any skill you would like to achieve, the key to speaking English with confidence is to practise, practice and practise some more. Be consistent in your language journey, have the right attitude, stay calm, get comfortable with making mistakes and congratulate yourself for every win."
        }
      ],
      [
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Are you feeling confident, yet? "
        },
        {
          "type": "TextTitle",
          "styles": ["bold"],
          "text": "Commit to trying one of these smart tips today and see how much more confident it makes you in Communicating in English."
        }
      ]
    ]
  },
  {
    "type": "ActionButtons",
    "text": "/topic/1/content/3",
    "next_btn_state": false
  }
]
